code/openfoam/test/thermo/compileTemplate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.5;

vertices
(
    (-1 -1 -0.1)
    ( 1 -1 -0.1)
    (-1  1 -0.1)
    ( 1  1 -0.1)

    (-1 -1  0.1)
    ( 1 -1  0.1)
    (-1  1  0.1)
    ( 1  1  0.1)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (1 1 1) simpleGrading (1 1 1)
);

defaultPatch
{
    name frontAndBack;
    type empty;
}

boundary
(
    inlet
    {
        type    patch;
        faces
        (
            (0 2 6 4)
        );
    }
    outlet
    {
        type    patch;
        faces
        (
            (1 3 7 5)
        );
    }
    walls
    {
        type    wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }
);


// ************************************************************************* //
